app/Controllers/IndexController.php

SELECT *
FROM `usuarios`
WHERE `usuario` = 'saulfuentes'
---
    public function signin()
    {
        $usuarios = new ModelUsuarios();
        $usr = $this->request->getPost("usuario");
        $pass = $this->request->getPost("password");

        $request = $usuarios->where('usuario', $usr)->find();