app/Controllers/ServiciosController.php

    public function getSell()
    {
        $servicios = new ModelServicios();
        $arrData = $servicios->where("status", 1)->findAll();
---
SELECT *
FROM `servicios`
WHERE `status` = 1